# #შექმენით სია სადაც გექნებათ მოცემული 5 სახელი, index ების გამოყენებით დაბეჭდეთ ცალცალკე, dont use for cycle

# list = ["giorgi", "luka", "mariami", "nika", "mate"]
# print(list[0], list[1], list[2], list[3], list[4])


# #შექმენით სია სადაც გექნებათ მოცემული 5 სახელი, for ციკლის გამოყენებით კი დაბეჭდეთ თითოეული

# list2 = ["giorgi", "luka", "mariami", "nika", "mate"]
# for i in range(len(list2)):
#     print(list2[i])


#შექმენით სია სადაც გექნებათ 1-10 ჩათვლი რიცხვები, for ციკლის გამოყენებით დაბეჭდეთ არ რიცხვების ჯამი ცალკე და ნამრავლი ცალკე

# list3 = [1,2,3,4,5,6,7,8,9,10]
# for i in range(len(list3)):
#     print()

#მესამე ვერ გავაკეთე


# შექმენით სია სადაც გექნებათ 1-10 ჩათვლით რიცხვები, for ციკლის გამოყენებით დაბეჭდეთ მხოლოდ ლუწი რიცხვები და მათი ჯამი

# list4 = [1,2,3,4,5,6,7,8,9,10]

# result = 0

# for i in list4:
#     if i % 2 == 0:
#         result = result + i

# print(result)


#შექმენით სია სადაც გექნებათ 1-10 ჩათვლით რიცხვები, for ციკლის გამოყენებით დაბეჭდეთ მხოლოდ კენტი რიცხვების ჯამი და ნამრავლი


# list5 = [1,2,3,4,5,6,7,8,9,10]

# result2 = 0
# result3 = 1

# for i in list5:
#     if i % 2 != 0:
#         result2 = result2 + i
#         result3 = result3 * i


# print(result2)
# print(result3)


#შექმენით სტრინგი და გამოიტანეთ for ციკლის მეშვეობით ყველა სიმბოლო


firstname = "Giorgi"

for i in range(0, len(firstname)):
    print(firstname[i])


#შექმენით სტრინგი და for ციკლის გამოყენებით შეართეთ მხოლოდ ის სიმბოლოები რომლებიც არიან ლუწ ინდექსებზე
#ეს ვერ გავაკეთე ერორები ამომიგდო რომ ვცადე